{
    "format": "layers-model",
    "generatedBy": "tfjs-converter",
    "convertedBy": "TensorFlow.js Converter vX.X.X",
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "batch_input_shape": [null, 10],
              "dtype": "float32",
              "input_dim": 1000,
              "output_dim": 16,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              }
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "units": 32,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "units": 5,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          }
        ]
      }
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {
            "name": "embedding/embeddings",
            "shape": [1000, 16],
            "dtype": "float32"
          },
          {
            "name": "lstm/lstm_cell/kernel",
            "shape": [16, 128],
            "dtype": "float32"
          },
          {
            "name": "lstm/lstm_cell/recurrent_kernel",
            "shape": [32, 128],
            "dtype": "float32"
          },
          {
            "name": "lstm/lstm_cell/bias",
            "shape": [128],
            "dtype": "float32"
          },
          {
            "name": "dense/kernel",
            "shape": [32, 5],
            "dtype": "float32"
          },
          {
            "name": "dense/bias",
            "shape": [5],
            "dtype": "float32"
          }
        ]
      }
    ]
  }