{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_8",
            "layers": [
                {
                    "class_name": "Embedding",
                    "config": {
                        "input_dim": 60,
                        "output_dim": 16,
                        "embeddings_initializer": {
                            "class_name": "RandomUniform",
                            "config": {
                                "minval": -0.05,
                                "maxval": 0.05,
                                "seed": null
                            }
                        },
                        "embeddings_regularizer": null,
                        "activity_regularizer": null,
                        "embeddings_constraint": null,
                        "mask_zero": null,
                        "input_length": 10,
                        "name": "embedding_Embedding8",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            10
                        ]
                    }
                },
                {
                    "class_name": "LSTM",
                    "config": {
                        "name": "lstm_LSTM8",
                        "trainable": true,
                        "units": 32,
                        "activation": "tanh",
                        "recurrent_activation": "hard_sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": []
                        },
                        "unit_forget_bias": null,
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0,
                        "recurrent_dropout": 0,
                        "implementation": null,
                        "return_sequences": false,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 5,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": []
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense8",
                        "trainable": true
                    }
                }
            ]
        },
        "keras_version": "tfjs-layers 4.22.0",
        "backend": "tensor_flow.js"
    },
    "weightsManifest": [
        {
            "paths": [
                "weights.bin"
            ],
            "weights": [
                {
                    "name": "embedding_Embedding8\/embeddings",
                    "shape": [
                        60,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_LSTM8\/kernel",
                    "shape": [
                        16,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_LSTM8\/recurrent_kernel",
                    "shape": [
                        32,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_LSTM8\/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense8\/kernel",
                    "shape": [
                        32,
                        5
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense8\/bias",
                    "shape": [
                        5
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}